In [101]:
import pandas as pd

In [102]:
dac_init = pd.read_csv('elevation.csv')
dac_init.head()

,NAME,STATE_NAME,STATE_FIPS,CNTY_FIPS,FIPS,Rowid_,FIPS_1,ZONE_CODE,COUNT,AREA,MIN,MAX,RANGE,MEAN,STD,SUM,VARIETY,MAJORITY,MINORITY,MEDIAN
0,Lauderdale,Alabama,1,77,1077,2121,1077,2121,2699,0.187431,126,274,148,194.816228,29.115953,525809.0,139,213,131,193
1,Limestone,Alabama,1,83,1083,2122,1083,2122,2239,0.155486,169,280,111,210.340331,27.530799,470952.0,109,213,260,213
2,Madison,Alabama,1,89,1089,2131,1089,2131,3038,0.210972,169,549,380,242.428242,65.020587,736497.0,294,244,282,233
3,Jackson,Alabama,1,71,1071,2132,1071,2132,4122,0.286250,177,549,372,320.258370,112.967006,1320105.0,352,183,179,311
4,Colbert,Alabama,1,33,1033,2148,1033,2148,2291,0.159097,126,284,158,179.550851,33.368155,411351.0,143,183,253,174

In [103]:
dac_sorted = dac_init.groupby('STATE_NAME', group_keys=False).apply(lambda x: x.sort_values('NAME')).reset_index(drop=True)

dac_sorted = dac_sorted.rename(columns={'NAME': 'County', 'STATE_NAME': 'State'})
dac_sorted.head()

,County,State,STATE_FIPS,CNTY_FIPS,FIPS,Rowid_,FIPS_1,ZONE_CODE,COUNT,AREA,MIN,MAX,RANGE,MEAN,STD,SUM,VARIETY,MAJORITY,MINORITY,MEDIAN
0,Autauga,Alabama,1,1,1001,2505,1001,2505,2145,0.148958,24,213,189,111.111422,41.013900,238334.0,175,122,29,116
1,Baldwin,Alabama,1,3,1003,2707,1003,2707,5724,0.397500,0,103,103,36.783019,22.833821,210546.0,103,6,102,36
2,Barbour,Alabama,1,5,1005,2584,1005,2584,3214,0.223194,46,200,154,114.048849,29.542705,366553.0,145,150,47,116
3,Bibb,Alabama,1,7,1007,2426,1007,2426,2284,0.158611,52,220,168,125.742119,31.190822,287195.0,153,122,54,122
4,Blount,Alabama,1,9,1009,2259,1009,2259,2417,0.167847,91,446,355,240.213488,63.854905,580596.0,296,244,94,244

In [104]:
ref = pd.read_csv('reforestation.csv')
ref.head()

,State,Abbreviation,County,Population,Temperature,Precipitation,Palmer-Z,Land-Prices,Population_Class,Temperature_Class,Precipitation_Class,Palmer-Z_Class,Land-Prices_Class,percentile_rank,Final_Class
0,Alabama,AL,Autauga,59759,66.1,51.89,-0.26,0,2,5,3,5,0,0.0,0
1,Alabama,AL,Baldwin,246435,70.1,50.71,-0.84,0,1,5,3,2,0,0.0,0
2,Alabama,AL,Barbour,24706,66.4,48.95,-0.22,0,4,5,3,5,0,0.0,0
3,Alabama,AL,Bibb,22005,64.4,53.22,-0.29,0,4,6,1,5,0,0.0,0
4,Alabama,AL,Blount,59512,62.5,60.68,0.24,0,2,6,1,7,0,0.0,0

In [105]:
merged_df = pd.merge(ref, dac_sorted[['County', 'State', 'MEAN']], on=['County', 'State'], how='left')
merged_df = merged_df.rename(columns={'MEAN': 'Elevation'})
merged_df.head()

,State,Abbreviation,County,Population,Temperature,Precipitation,Palmer-Z,Land-Prices,Population_Class,Temperature_Class,Precipitation_Class,Palmer-Z_Class,Land-Prices_Class,percentile_rank,Final_Class,Elevation
0,Alabama,AL,Autauga,59759,66.1,51.89,-0.26,0,2,5,3,5,0,0.0,0,111.111422
1,Alabama,AL,Baldwin,246435,70.1,50.71,-0.84,0,1,5,3,2,0,0.0,0,36.783019
2,Alabama,AL,Barbour,24706,66.4,48.95,-0.22,0,4,5,3,5,0,0.0,0,114.048849
3,Alabama,AL,Bibb,22005,64.4,53.22,-0.29,0,4,6,1,5,0,0.0,0,125.742119
4,Alabama,AL,Blount,59512,62.5,60.68,0.24,0,2,6,1,7,0,0.0,0,240.213488

In [106]:
merged_df= merged_df.drop(columns=['Palmer-Z','Land-Prices','Population_Class','Temperature_Class','Precipitation_Class','Palmer-Z_Class','Land-Prices_Class','percentile_rank','Final_Class'])
merged_df.head()

,State,Abbreviation,County,Population,Temperature,Precipitation,Elevation
0,Alabama,AL,Autauga,59759,66.1,51.89,111.111422
1,Alabama,AL,Baldwin,246435,70.1,50.71,36.783019
2,Alabama,AL,Barbour,24706,66.4,48.95,114.048849
3,Alabama,AL,Bibb,22005,64.4,53.22,125.742119
4,Alabama,AL,Blount,59512,62.5,60.68,240.213488

In [107]:
no_na = merged_df.dropna()
no_na.isna().sum()

State            0
Abbreviation     0
County           0
Population       0
Temperature      0
Precipitation    0
Elevation        0
dtype: int64

In [108]:
elec = pd.read_csv('electricity.csv')
elec.head()

                                               state  value
0  Table 5.6.A. Average Price of Electricity to U...  25.44
1  by State, August 2023 and 2022 (Cents per Kilo...  18.98
2                                        New England  18.72
3                                        Connecticut  20.02
4                                              Maine  14.34

In [109]:
values_to_drop = ['New England', 'Middle Atlantic','East North Central','West North Central',
                  'South Atlantic', 'East South Central','West South Central','Mountain','Pacific Contiguous','Pacific Noncontiguous']

elec = elec[~elec['state'].isin(values_to_drop)]
elec = elec.drop(elec.index[-1])

In [110]:
elec = elec.rename(columns={'state': 'State', 'value': 'Electricity-Prices'})
elec.head()

                                               State  Electricity-Prices
0  Table 5.6.A. Average Price of Electricity to U...               25.44
1  by State, August 2023 and 2022 (Cents per Kilo...               18.98
3                                        Connecticut               20.02
4                                              Maine               14.34
5                                      Massachusetts               19.32

In [111]:
elec_sorted= elec.sort_values(by='State')
elec_sorted.head()

         State  Electricity-Prices
38     Alabama               14.21
61      Alaska               20.35
48     Arizona               11.46
43    Arkansas               10.79
57  California               24.71

In [112]:
merged_df2 = no_na.merge(elec_sorted, on='State', how='left')

In [113]:
wages = pd.read_csv('wages-pdf-extract.csv')

In [114]:
wages = wages.iloc[:, [0, 3]]
wages.columns = ['Name', 'Wage']

In [115]:
wages

            Name     Wage
0        Alabama   49,769
1        Autauga   48,347
2        Baldwin   54,659
3        Barbour   40,428
4           Bibb   36,892
...          ...      ...
3186  Sweetwater   56,934
3187       Teton  318,297
3188       Uinta   44,157
3189    Washakie   60,235
3190      Weston   49,526

[3191 rows x 2 columns]

In [116]:
wages['State'] = None
current_state = 'Alabama' 
next_row_is_state = False

for index, row in wages.iterrows():
    if pd.isna(row['Name']):
        next_row_is_state = True 
    elif next_row_is_state:
        current_state = row['Name'] 
        next_row_is_state = False  
    else:
        wages.at[index, 'State'] = current_state

df = wages[wages['State'].notnull() & wages['Wage'].notnull()]
df.reset_index(drop=True, inplace=True)

            Name     Wage    State
0        Alabama   49,769  Alabama
1        Autauga   48,347  Alabama
2        Baldwin   54,659  Alabama
3        Barbour   40,428  Alabama
4           Bibb   36,892  Alabama
...          ...      ...      ...
3186  Sweetwater   56,934  Wyoming
3187       Teton  318,297  Wyoming
3188       Uinta   44,157  Wyoming
3189    Washakie   60,235  Wyoming
3190      Weston   49,526  Wyoming

[3191 rows x 3 columns]

In [117]:
wages = wages.rename(columns={'Name': 'County'})
wages.head()

    County    Wage    State
0  Alabama  49,769  Alabama
1  Autauga  48,347  Alabama
2  Baldwin  54,659  Alabama
3  Barbour  40,428  Alabama
4     Bibb  36,892  Alabama

In [118]:
import numpy as np
wages = wages[wages['State'].notna()]
wages = wages.iloc[1:]

In [119]:
wages = wages[wages['Wage'].str.contains('NA') == False]
wages.loc[:, 'Wage'] = wages['Wage'].astype(str).str.replace(',', '')
wages.loc[:, 'Wage'] = pd.to_numeric(wages['Wage'], errors='coerce')

In [121]:
wages = wages.assign(County=wages['County'].str.split(' \+ |, ')).explode('County')
wages = wages.reset_index(drop=True)

In [122]:
wages.to_csv('wages.csv', index=False)

In [123]:
dac = pd.merge(merged_df2, wages[['County', 'State', 'Wage']], on=['County', 'State'], how='left')
dac.head()

,State,Abbreviation,County,Population,Temperature,Precipitation,Elevation,Electricity-Prices,Wage
0,Alabama,AL,Autauga,59759,66.1,51.89,111.111422,14.21,48347
1,Alabama,AL,Baldwin,246435,70.1,50.71,36.783019,14.21,54659
2,Alabama,AL,Barbour,24706,66.4,48.95,114.048849,14.21,40428
3,Alabama,AL,Bibb,22005,64.4,53.22,125.742119,14.21,36892
4,Alabama,AL,Blount,59512,62.5,60.68,240.213488,14.21,42634

In [132]:
dac['Wage'] = dac['Wage'].astype(str).str.replace(',', '').astype(float)
mean_wages_by_state = dac.groupby('State')['Wage'].transform('mean')
dac['Wage'] = dac['Wage'].fillna(mean_wages_by_state)
dac['Wage'] = dac['Wage'].round(2)

In [133]:
dac.to_csv('dac.csv', index=False)